Hongyu1231/Traffic_Light/MCXC444/MCXC444/source/traffic_gpio.c
#include "traffic_gpio.h"

#include "board.h"
#include "fsl_common.h"
#include "FreeRTOS.h"
#include "task.h"
#include "traffic_lcd.h"

void initGPIO(void)
{
    SIM->SCGC5 |= SIM_SCGC5_PORTC_MASK | SIM_SCGC5_PORTD_MASK | SIM_SCGC5_PORTE_MASK;

    PORTD->PCR[GREEN_PIN] = PORT_PCR_MUX(1);
    GPIOD->PDDR |= (1UL << GREEN_PIN);

    PORTE->PCR[RED_PIN] = PORT_PCR_MUX(1);
    PORTE->PCR[BLUE_PIN] = PORT_PCR_MUX(1);
    GPIOE->PDDR |= (1UL << RED_PIN) | (1UL << BLUE_PIN);

    PORTE->PCR[PEDESTRIAN_BUZZER_PIN] = PORT_PCR_MUX(1);
    GPIOE->PDDR |= (1UL << PEDESTRIAN_BUZZER_PIN);

    PORTC->PCR[PEDESTRIAN_RED] = PORT_PCR_MUX(1);
    GPIOC->PDDR |= (1UL << PEDESTRIAN_RED);

    PORTC->PCR[PEDESTRIAN_GREEN] = PORT_PCR_MUX(1);
    GPIOC->PDDR |= (1UL << PEDESTRIAN_GREEN);

    allLEDsOff();
    setPedestrianLightToRed();
    offPedestrianBuzzer();
}

void ledOn(TLED led)
{
    switch (led) {
    case RED:
        GPIOE->PCOR = (1UL << RED_PIN);
        break;
    case GREEN:
        GPIOD->PCOR = (1UL << GREEN_PIN);
        break;
    case BLUE:
        GPIOE->PCOR = (1UL << BLUE_PIN);
        break;
    default:
        break;
    }
}

void ledOff(TLED led)
{
    switch (led) {
    case RED:
        GPIOE->PSOR = (1UL << RED_PIN);
        break;
    case GREEN:
        GPIOD->PSOR = (1UL << GREEN_PIN);
        break;
    case BLUE:
        GPIOE->PSOR = (1UL << BLUE_PIN);
        break;
    default:
        break;
    }
}

void allLEDsOff(void)
{
    ledOff(RED);
    ledOff(GREEN);
    ledOff(BLUE);
}

void onPedestrianBuzzer(void)
{
    GPIOE->PSOR = (1UL << PEDESTRIAN_BUZZER_PIN);
}

void offPedestrianBuzzer(void)
{
    GPIOE->PCOR = (1UL << PEDESTRIAN_BUZZER_PIN);
}

void togglePedestrianLight(void)
{
    GPIOC->PCOR = (1UL << PEDESTRIAN_RED);
    GPIOC->PSOR = (1UL << PEDESTRIAN_GREEN);
}

void setPedestrianLightToRed(void)
{
    GPIOC->PSOR = (1UL << PEDESTRIAN_RED);
    GPIOC->PCOR = (1UL << PEDESTRIAN_GREEN);
}

void holdPedestrianGreen(uint32_t duration_seconds)
{
    if (duration_seconds == 0U) {
        setLCDCountdownValue(0);
        return;
    }

    GPIOC->PCOR = (1UL << PEDESTRIAN_RED);
    GPIOC->PSOR = (1UL << PEDESTRIAN_GREEN);
    offPedestrianBuzzer();
    setLCDCountdownValue(0);
    vTaskDelay(pdMS_TO_TICKS(duration_seconds * 1000U));
}

void blinkPedestrianLight(uint32_t duration_seconds)
{
    uint32_t remaining_seconds;

    if (duration_seconds == 0U) {
        setLCDCountdownValue(0);
        return;
    }

    for (remaining_seconds = duration_seconds; remaining_seconds > 0U; remaining_seconds--) {
        setLCDCountdownValue((int)remaining_seconds);
        GPIOC->PCOR = (1UL << PEDESTRIAN_GREEN);
        offPedestrianBuzzer();
        vTaskDelay(pdMS_TO_TICKS(500U));

        GPIOC->PSOR = (1UL << PEDESTRIAN_GREEN);
        onPedestrianBuzzer();
        vTaskDelay(pdMS_TO_TICKS(500U));
    }

    setLCDCountdownValue(0);
}
